<net name="ResNet-50" version="2" batch="1">
    <layers>
        <layer name="input" type="Input" precision="FP32" id="0">
            <output>
                <port id="0">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>224</dim>
                    <dim>224</dim>
                </port>
            </output>
        </layer>
        <layer name="conv1" type="Convolution" precision="FP32" id="1">
            <convolution_data stride-x="2" stride-y="2" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="64" group="1"/>
            <input>
                <port id="1">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>224</dim>
                    <dim>224</dim>
                </port>
            </input>
            <output>
                <port id="2">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>112</dim>
                    <dim>112</dim>
                </port>
            </output>
            <weights offset="0" size="37632"/>
            <biases offset="37632" size="256"/>
        </layer>
        <layer name="conv1_relu" type="ReLU" precision="FP32" id="4">
            <input>
                <port id="7">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>112</dim>
                    <dim>112</dim>
                </port>
            </input>
            <output>
                <port id="8">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>112</dim>
                    <dim>112</dim>
                </port>
            </output>
        </layer>
        <layer name="pool1" type="Pooling" precision="FP32" id="5">
            <pooling_data kernel-x="3" kernel-y="3" pad-x="0" pad-y="0" stride-x="2" stride-y="2" rounding-type="ceil" pool-method="max"/>
            <input>
                <port id="9">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>112</dim>
                    <dim>112</dim>
                </port>
            </input>
            <output>
                <port id="10">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
        </layer>
        <layer name="res2a_branch2a" type="Convolution" precision="FP32" id="9">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="17">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="18">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
            <weights offset="37888" size="16384"/>
            <biases offset="54272" size="256"/>
        </layer>
        <layer name="res2a_branch2a_relu" type="ReLU" precision="FP32" id="12">
            <input>
                <port id="23">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="24">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
        </layer>
        <layer name="res2a_branch2b" type="Convolution" precision="FP32" id="13">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
            <input>
                <port id="25">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="26">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
            <weights offset="54528" size="147456"/>
            <biases offset="201984" size="256"/>
        </layer>
        <layer name="res2a_branch2b_relu" type="ReLU" precision="FP32" id="16">
            <input>
                <port id="31">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
        </layer>
        <layer name="res2a_branch2c" type="Convolution" precision="FP32" id="17">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
            <input>
                <port id="33">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="34">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
            <weights offset="202240" size="65536"/>
            <biases offset="267776" size="1024"/>
        </layer>
        <layer name="res2a_branch1" type="Convolution" precision="FP32" id="6">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
            <input>
                <port id="11">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="12">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
            <weights offset="268800" size="65536"/>
            <biases offset="334336" size="1024"/>
        </layer>
        <layer name="res2a" type="Eltwise" precision="FP32" id="20">
            <elementwise_data operation="sum"/>
            <input>
                <port id="39">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
                <port id="40">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="41">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
        </layer>
        <layer name="res2a_relu" type="ReLU" precision="FP32" id="21">
            <input>
                <port id="42">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="43">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
        </layer>
        <layer name="res2b_branch2a" type="Convolution" precision="FP32" id="22">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="44">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="45">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
            <weights offset="335360" size="65536"/>
            <biases offset="400896" size="256"/>
        </layer>
        <layer name="res2b_branch2a_relu" type="ReLU" precision="FP32" id="25">
            <input>
                <port id="50">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="51">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
        </layer>
        <layer name="res2b_branch2b" type="Convolution" precision="FP32" id="26">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
            <input>
                <port id="52">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="53">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
            <weights offset="401152" size="147456"/>
            <biases offset="548608" size="256"/>
        </layer>
        <layer name="res2b_branch2b_relu" type="ReLU" precision="FP32" id="29">
            <input>
                <port id="58">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="59">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
        </layer>
        <layer name="res2b_branch2c" type="Convolution" precision="FP32" id="30">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
            <input>
                <port id="60">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="61">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
            <weights offset="548864" size="65536"/>
            <biases offset="614400" size="1024"/>
        </layer>
        <layer name="res2b" type="Eltwise" precision="FP32" id="33">
            <elementwise_data operation="sum"/>
            <input>
                <port id="66">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
                <port id="67">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="68">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
        </layer>
        <layer name="res2b_relu" type="ReLU" precision="FP32" id="34">
            <input>
                <port id="69">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="70">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
        </layer>
        <layer name="res2c_branch2a" type="Convolution" precision="FP32" id="35">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="71">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="72">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
            <weights offset="615424" size="65536"/>
            <biases offset="680960" size="256"/>
        </layer>
        <layer name="res2c_branch2a_relu" type="ReLU" precision="FP32" id="38">
            <input>
                <port id="77">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="78">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
        </layer>
        <layer name="res2c_branch2b" type="Convolution" precision="FP32" id="39">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
            <input>
                <port id="79">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="80">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
            <weights offset="681216" size="147456"/>
            <biases offset="828672" size="256"/>
        </layer>
        <layer name="res2c_branch2b_relu" type="ReLU" precision="FP32" id="42">
            <input>
                <port id="85">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="86">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
        </layer>
        <layer name="res2c_branch2c" type="Convolution" precision="FP32" id="43">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
            <input>
                <port id="87">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="88">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
            <weights offset="828928" size="65536"/>
            <biases offset="894464" size="1024"/>
        </layer>
        <layer name="res2c" type="Eltwise" precision="FP32" id="46">
            <elementwise_data operation="sum"/>
            <input>
                <port id="93">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
                <port id="94">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="95">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
        </layer>
        <layer name="res2c_relu" type="ReLU" precision="FP32" id="47">
            <input>
                <port id="96">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="97">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </output>
        </layer>
        <layer name="res3a_branch2a" type="Convolution" precision="FP32" id="51">
            <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
            <input>
                <port id="104">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="105">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
            <weights offset="895488" size="131072"/>
            <biases offset="1026560" size="512"/>
        </layer>
        <layer name="res3a_branch2a_relu" type="ReLU" precision="FP32" id="54">
            <input>
                <port id="110">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="111">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3a_branch2b" type="Convolution" precision="FP32" id="55">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="112">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="113">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
            <weights offset="1027072" size="589824"/>
            <biases offset="1616896" size="512"/>
        </layer>
        <layer name="res3a_branch2b_relu" type="ReLU" precision="FP32" id="58">
            <input>
                <port id="118">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="119">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3a_branch2c" type="Convolution" precision="FP32" id="59">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1"/>
            <input>
                <port id="120">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="121">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
            <weights offset="1617408" size="262144"/>
            <biases offset="1879552" size="2048"/>
        </layer>
        <layer name="res3a_branch1" type="Convolution" precision="FP32" id="48">
            <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1"/>
            <input>
                <port id="98">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>56</dim>
                    <dim>56</dim>
                </port>
            </input>
            <output>
                <port id="99">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
            <weights offset="1881600" size="524288"/>
            <biases offset="2405888" size="2048"/>
        </layer>
        <layer name="res3a" type="Eltwise" precision="FP32" id="62">
            <elementwise_data operation="sum"/>
            <input>
                <port id="126">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
                <port id="127">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="128">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3a_relu" type="ReLU" precision="FP32" id="63">
            <input>
                <port id="129">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="130">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3b_branch2a" type="Convolution" precision="FP32" id="64">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
            <input>
                <port id="131">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="132">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
            <weights offset="2407936" size="262144"/>
            <biases offset="2670080" size="512"/>
        </layer>
        <layer name="res3b_branch2a_relu" type="ReLU" precision="FP32" id="67">
            <input>
                <port id="137">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="138">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3b_branch2b" type="Convolution" precision="FP32" id="68">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="139">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="140">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
            <weights offset="2670592" size="589824"/>
            <biases offset="3260416" size="512"/>
        </layer>
        <layer name="res3b_branch2b_relu" type="ReLU" precision="FP32" id="71">
            <input>
                <port id="145">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="146">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3b_branch2c" type="Convolution" precision="FP32" id="72">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1"/>
            <input>
                <port id="147">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="148">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
            <weights offset="3260928" size="262144"/>
            <biases offset="3523072" size="2048"/>
        </layer>
        <layer name="res3b" type="Eltwise" precision="FP32" id="75">
            <elementwise_data operation="sum"/>
            <input>
                <port id="153">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
                <port id="154">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="155">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3b_relu" type="ReLU" precision="FP32" id="76">
            <input>
                <port id="156">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="157">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3c_branch2a" type="Convolution" precision="FP32" id="77">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
            <input>
                <port id="158">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="159">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
            <weights offset="3525120" size="262144"/>
            <biases offset="3787264" size="512"/>
        </layer>
        <layer name="res3c_branch2a_relu" type="ReLU" precision="FP32" id="80">
            <input>
                <port id="164">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="165">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3c_branch2b" type="Convolution" precision="FP32" id="81">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="166">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="167">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
            <weights offset="3787776" size="589824"/>
            <biases offset="4377600" size="512"/>
        </layer>
        <layer name="res3c_branch2b_relu" type="ReLU" precision="FP32" id="84">
            <input>
                <port id="172">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="173">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3c_branch2c" type="Convolution" precision="FP32" id="85">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1"/>
            <input>
                <port id="174">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="175">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
            <weights offset="4378112" size="262144"/>
            <biases offset="4640256" size="2048"/>
        </layer>
        <layer name="res3c" type="Eltwise" precision="FP32" id="88">
            <elementwise_data operation="sum"/>
            <input>
                <port id="180">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
                <port id="181">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="182">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3c_relu" type="ReLU" precision="FP32" id="89">
            <input>
                <port id="183">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="184">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3d_branch2a" type="Convolution" precision="FP32" id="90">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
            <input>
                <port id="185">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="186">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
            <weights offset="4642304" size="262144"/>
            <biases offset="4904448" size="512"/>
        </layer>
        <layer name="res3d_branch2a_relu" type="ReLU" precision="FP32" id="93">
            <input>
                <port id="191">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="192">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3d_branch2b" type="Convolution" precision="FP32" id="94">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="193">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="194">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
            <weights offset="4904960" size="589824"/>
            <biases offset="5494784" size="512"/>
        </layer>
        <layer name="res3d_branch2b_relu" type="ReLU" precision="FP32" id="97">
            <input>
                <port id="199">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="200">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3d_branch2c" type="Convolution" precision="FP32" id="98">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1"/>
            <input>
                <port id="201">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="202">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
            <weights offset="5495296" size="262144"/>
            <biases offset="5757440" size="2048"/>
        </layer>
        <layer name="res3d" type="Eltwise" precision="FP32" id="101">
            <elementwise_data operation="sum"/>
            <input>
                <port id="207">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
                <port id="208">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="209">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res3d_relu" type="ReLU" precision="FP32" id="102">
            <input>
                <port id="210">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="211">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </output>
        </layer>
        <layer name="res4a_branch2a" type="Convolution" precision="FP32" id="106">
            <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
            <input>
                <port id="218">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="219">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
            <weights offset="5759488" size="524288"/>
            <biases offset="6283776" size="1024"/>
        </layer>
        <layer name="res4a_branch2a_relu" type="ReLU" precision="FP32" id="109">
            <input>
                <port id="224">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="225">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
        </layer>
        <layer name="res4a_branch2b" type="Convolution" precision="FP32" id="110">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
            <input>
                <port id="226">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="227">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
            <weights offset="6284800" size="2359296"/>
            <biases offset="8644096" size="1024"/>
        </layer>
        <layer name="res4a_branch2b_relu" type="ReLU" precision="FP32" id="113">
            <input>
                <port id="232">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="233">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
        </layer>
        <layer name="res4a_branch2c" type="Convolution" precision="FP32" id="114">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="1024" group="1"/>
            <input>
                <port id="234">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="235">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
            <weights offset="8645120" size="1048576"/>
            <biases offset="9693696" size="4096"/>
        </layer>
        <layer name="res4a_branch1" type="Convolution" precision="FP32" id="103">
            <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="1024" group="1"/>
            <input>
                <port id="212">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>28</dim>
                    <dim>28</dim>
                </port>
            </input>
            <output>
                <port id="213">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
            <weights offset="9697792" size="2097152"/>
            <biases offset="11794944" size="4096"/>
        </layer>
        <layer name="res4a" type="Eltwise" precision="FP32" id="117">
            <elementwise_data operation="sum"/>
            <input>
                <port id="240">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
                <port id="241">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="242">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
        </layer>
        <layer name="res4a_relu" type="ReLU" precision="FP32" id="118">
            <input>
                <port id="243">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="244">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
        </layer>
        <layer name="res4b_branch2a" type="Convolution" precision="FP32" id="119">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
            <input>
                <port id="245">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="246">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
            <weights offset="11799040" size="1048576"/>
            <biases offset="12847616" size="1024"/>
        </layer>
        <layer name="res4b_branch2a_relu" type="ReLU" precision="FP32" id="122">
            <input>
                <port id="251">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="252">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
        </layer>
        <layer name="res4b_branch2b" type="Convolution" precision="FP32" id="123">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
            <input>
                <port id="253">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="254">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
            <weights offset="12848640" size="2359296"/>
            <biases offset="15207936" size="1024"/>
        </layer>
        <layer name="res4b_branch2b_relu" type="ReLU" precision="FP32" id="126">
            <input>
                <port id="259">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="260">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
        </layer>
        <layer name="res4b_branch2c" type="Convolution" precision="FP32" id="127">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="1024" group="1"/>
            <input>
                <port id="261">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="262">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
            <weights offset="15208960" size="1048576"/>
            <biases offset="16257536" size="4096"/>
        </layer>
        <layer name="res4b" type="Eltwise" precision="FP32" id="130">
            <elementwise_data operation="sum"/>
            <input>
                <port id="267">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
                <port id="268">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="269">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
        </layer>
        <layer name="res4b_relu" type="ReLU" precision="FP32" id="131">
            <input>
                <port id="270">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="271">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
        </layer>
        <layer name="res4c_branch2a" type="Convolution" precision="FP32" id="132">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
            <input>
                <port id="272">
                    <dim>1</dim>
                    <dim>1024</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="273">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
            <weights offset="16261632" size="1048576"/>
            <biases offset="17310208" size="1024"/>
        </layer>
        <layer name="res4c_branch2a_relu" type="ReLU" precision="FP32" id="135">
            <input>
                <port id="278">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </input>
            <output>
                <port id="279">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>14</dim>
                    <dim>14</dim>
                </port>
            </output>
        </layer>
